tap "anhoder/go-musicfox"
tap "nikitabobko/tap"
tap "tw93/tap"
brew "bash"
brew "bat"
brew "btop"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gdu"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "handbrake"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "ripgrep"
brew "smartmontools"
brew "starship"
brew "tmux"
brew "uv"
brew "yazi"
brew "zoxide"
brew "anhoder/go-musicfox/go-musicfox"
brew "tw93/tap/mole"
cask "nikitabobko/tap/aerospace"
cask "aldente"
cask "antigravity"
cask "betterdisplay"
cask "blender"
cask "cursor"
cask "easydict"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nf"
cask "font-sarasa-gothic"
cask "ghostty"
cask "google-chrome"
cask "homerow"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keka"
cask "lunarbar"
cask "miniforge"
cask "navicat-premium-lite"
cask "neovide-app"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "sf-symbols"
cask "spotify"
cask "trae-cn"
cask "typora"
cask "unity-hub"
cask "visual-studio-code"
cask "wetype"
cask "zed"
mas "BaiduNetdisk", id: 547166701
mas "Canva", id: 897446215
mas "Keynote", id: 409183694
mas "Live Wallpaper", id: 1456235760
mas "NetEaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Picview", id: 6452016140
mas "QQ", id: 451108668
mas "uBlock Origin Lite", id: 6745342698
mas "UPDF", id: 1619925971
mas "WeChat", id: 836500024
mas "WPS Office", id: 1443749478
mas "Xcode", id: 497799835
mas "剪映专业版", id: 1529999940
vscode "be5invis.vscode-custom-css"
vscode "brandonkirbyson.vscode-animations"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "mvllow.rose-pine"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "zhuangtongfa.material-theme"
